ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_mcan_error_regs.xml
<module id="MCAN_ERROR_REGS" HW_revision="" description="MCAN ERROR Registers">
	<register id="MCANERR_REV" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="MCAN Error Aggregator Revision Register">
		<bitfield id="REVMIN" description="Minor Revision" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="REVMAJ" description="Major Revision" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="MODULE_ID" description="Module Identification Number" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="SCHEME" description="PID Register Scheme" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="MCANERR_VECTOR" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="MCAN ECC Vector Register">
		<bitfield id="ECC_VECTOR" description="ECC RAM ID" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="RD_SVBUS" description="Read Trigger" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="RD_SVBUS_ADDRESS" description="Read Address Offset" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="RD_SVBUS_DONE" description="Read Completion Flag" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="MCANERR_STAT" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="MCAN Error Misc Status">
		<bitfield id="NUM_RAMS" description="Number of RAMs" begin="10" end="0" width="11" rwaccess="R"/>
	</register>
	<register id="MCANERR_WRAP_REV" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="MCAN ECC Wrapper Revision Register">
		<bitfield id="REVMIN" description="Minor Revision" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="REVMAJ" description="Major Revision" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="MODULE_ID" description="Module Identification Number" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="SCHEME" description="PID Register Scheme" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="MCANERR_CTRL" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="MCAN ECC Control">
		<bitfield id="ECC_ENABLE" description="Enable ECC Generation" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ECC_CHECK" description="Enable ECC Check" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ENABLE_RMW" description="Enable Read-Modify-Write" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FORCE_SEC" description="Force Single Bit Error Corrected Error" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FORCE_DED" description="Force Double Bit Error Detected Error" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="FORCE_N_ROW" description="Force Next Single/Double Bit Error" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ERROR_ONCE" description="Force Error Only Once Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CHECK_SVBUS_TIMEOUT" description="SVBUS Timeout Enable" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANERR_ERR_CTRL1" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="MCAN ECC Error Control 1 Register">
		<bitfield id="ECC_ROW" description="Force Error Row Address" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="MCANERR_ERR_CTRL2" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="MCAN ECC Error Control 2 Register">
		<bitfield id="ECC_BIT1" description="Force Error Bit1 Column Index" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="ECC_BIT2" description="Force Error Bit2 Column Index" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="MCANERR_ERR_STAT1" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="MCAN ECC Error Status 1 Register">
		<bitfield id="ECC_SEC" description="Single Bit Error Corrected Status" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="ECC_DED" description="Double Bit Error Detected Status" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="ECC_OTHER" description="SEC While Writeback Error Status" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CTRL_REG_ERROR" description="Control Register Error" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CLR_ECC_SEC" description="Clear ECC_SEC" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="CLR_ECC_DED" description="Clear ECC_DED" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="CLR_ECC_OTHER" description="Clear ECC_OTHER" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CLR_CTRL_REG_ERROR" description="Clear Control Register Error" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="ECC_BIT1" description="ECC Error Bit Position" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="MCANERR_ERR_STAT2" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="MCAN ECC Error Status 2 Register">
		<bitfield id="ECC_ROW" description="ECC Error Row Address" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MCANERR_ERR_STAT3" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="MCAN ECC Error Status 3 Register">
		<bitfield id="WB_PEND" description="Delayed Write Back Pending Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SVBUS_TIMEOUT" description="Serial VBUS Timeout Flag" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLR_SVBUS_TIMEOUT" description="Clear Serial VBUS Timeout" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANERR_SEC_EOI" width="32" page="0" offset="0x3c" instances="1" instaddr="4" internal="0" description="MCAN Single Error Corrected End of Interrupt Register">
		<bitfield id="EOI_WR" description="End of Interrupt" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANERR_SEC_STATUS" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="MCAN Single Error Corrected Interrupt Status Register">
		<bitfield id="MSGMEM_PEND" description="Message RAM SEC Interrupt Pending" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANERR_SEC_ENABLE_SET" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="MCAN Single Error Corrected Interrupt Enable Set Register">
		<bitfield id="MSGMEM_ENABLE_SET" description="Message RAM SEC Interrupt Pending Enable Set" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANERR_SEC_ENABLE_CLR" width="32" page="0" offset="0xc0" instances="1" instaddr="4" internal="0" description="MCAN Single Error Corrected Interrupt Enable Clear Register">
		<bitfield id="MSGMEM_ENABLE_CLR" description="Message RAM SEC Interrupt Pending Enable Clear" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANERR_DED_EOI" width="32" page="0" offset="0x13c" instances="1" instaddr="4" internal="0" description="MCAN Double Error Detected End of Interrupt Register">
		<bitfield id="EOI_WR" description="End of Interrupt" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANERR_DED_STATUS" width="32" page="0" offset="0x140" instances="1" instaddr="4" internal="0" description="MCAN Double Error Detected Interrupt Status Register">
		<bitfield id="MSGMEM_PEND" description="Message RAM DED Interrupt Pending" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANERR_DED_ENABLE_SET" width="32" page="0" offset="0x180" instances="1" instaddr="4" internal="0" description="MCAN Double Error Detected Interrupt Enable Set Register">
		<bitfield id="MSGMEM_ENABLE_SET" description="Message RAM DED Interrupt Pending Enable Set" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANERR_DED_ENABLE_CLR" width="32" page="0" offset="0x1c0" instances="1" instaddr="4" internal="0" description="MCAN Double Error Detected Interrupt Enable Clear Register">
		<bitfield id="MSGMEM_ENABLE_CLR" description="Message RAM DED Interrupt Pending Enable Clear" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANERR_AGGR_ENABLE_SET" width="32" page="0" offset="0x200" instances="1" instaddr="4" internal="0" description="MCAN Error Aggregator Enable Set Register">
		<bitfield id="ENABLE_PARITY_SET" description="Enable Parity Errors Set" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ENABLE_TIMEOUT_SET" description="Enable Timeout Errors Set" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANERR_AGGR_ENABLE_CLR" width="32" page="0" offset="0x204" instances="1" instaddr="4" internal="0" description="MCAN Error Aggregator Enable Clear Register">
		<bitfield id="ENABLE_PARITY_CLR" description="Enable Parity Errors Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ENABLE_TIMEOUT_CLR" description="Enable Timeout Errors Clear" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANERR_AGGR_STATUS_SET" width="32" page="0" offset="0x208" instances="1" instaddr="4" internal="0" description="MCAN Error Aggregator Status Set Register">
		<bitfield id="AGGR_PARITY_ERR" description="Aggregator Parity Error Status" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SVBUS_TIMEOUT" description="Aggregator Serial VBUS Timeout Error Status" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="MCANERR_AGGR_STATUS_CLR" width="32" page="0" offset="0x20c" instances="1" instaddr="4" internal="0" description="MCAN Error Aggregator Status Clear Register">
		<bitfield id="AGGR_PARITY_ERR" description="Aggregator Parity Error Status" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SVBUS_TIMEOUT" description="Aggregator Serial VBUS Timeout Error Status" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
</module>
